# Build Movie SQL DB with sqlalchemy
## MySQL Operation
- ### Create MySQL docker:
```yaml
version: "3.9"
services:
  mysql:
    image: mysql:latest
    container_name: nyahua-mysql
    environment:
      MYSQL_ROOT_PASSWORD: 9002005
      MYSQL_DATABASE: nyahuaDB
      MYSQL_USER: nyahua
      MYSQL_PASSWORD: 123456
    ports:
      - "3306:3306"
    volumes:
      - ./mariadb:/var/lib/mysql
```

- ### database management
-  you can enter into the container: `docker exec -it nyahua-mysql bash` then `mysql -u username -p`
- `enter` as root and grant all rights to `nyahua`
```bash
karibu@nyahua:~$ docker exec -it nyahua-mysql mysql -u root -p
mysql> GRANT ALL PRIVILEGES ON *.* TO 'nyahua'@'%';
```
- create your database
```bash
docker exec -it nyahua-mysql mysql -u nyahua -p
CREATE DATABASE movie
```

## Reference
- [SQLAchemy Replationship](https://docs.sqlalchemy.org/en/20/orm/basic_relationships.html)
- [ChatGPT on SQLAchemy](https://chat.openai.com/share/7393026c-d5ad-49f0-b910-2b4e837c8d0c)
- [IMDB Movies Dataset](https://www.kaggle.com/datasets/harshitshankhdhar/imdb-dataset-of-top-1000-movies-and-tv-shows/data)
- [OMDb API](http://www.omdbapi.com/)

## read [Json File](https://github.com/FEND16/movie-json-data) into datafram

In [2]:
import pandas as pd
import numpy as np
from pathlib import Path

    
df_movies = pd.read_csv('../dataset/imdb_top_1000.xls')
actors = np.unique(df_movies[['Star1', 'Star2', 'Star3', 'Star4']].values.flatten())
genre = np.unique(df_movies.Genre.str.split(', ').sum())

## Data Model

In [1]:
from sqlalchemy import create_engine, Table, Column, Integer, String, Text, ForeignKey
from sqlalchemy.ext.declarative import declarative_base
from sqlalchemy.orm import relationship, Session


database_url = 'mysql+mysqlconnector://nyahua:123456@nyahua.com:3306/movie'
engine = create_engine(database_url)
Base = declarative_base()

# Delete tables if exsits
with engine.connect() as conn:
    conn.execute("""
    DROP TABLE IF EXISTS 
    movie_actor_association, movies, actors;
    """)

# Define the association table for the many-to-many relationship
movie_actor_association = Table(
    'movie_actor_association', Base.metadata,
    Column('movie_id', Integer, ForeignKey('movies.id')),
    Column('actor_id', Integer, ForeignKey('actors.id'))
)

class Movie(Base):
    __tablename__ = 'movies'

    id = Column(Integer, primary_key=True)
    title = Column(Text)
    release_year = Column(Integer)

    # Establish the many-to-many relationship with actors
    actors = relationship('Actor', secondary=movie_actor_association, back_populates='movies')

# Define the Actor model
class Actor(Base):
    __tablename__ = 'actors'

    id = Column(Integer, primary_key=True)
    name = Column(Text)
    
    # Establish the many-to-many relationship with movies
    movies = relationship('Movie', secondary=movie_actor_association, back_populates='actors')

# Create the tables in the database
Base.metadata.create_all(engine)
session = Session(engine)

def add_new_actor(name):
    # Check if the actor already exists in the database
    existing_actor = session.query(Actor).filter_by(name=name).first()

    if existing_actor:
        return existing_actor
    else:
        # Create a new actor and add it to the session
        new_actor = Actor(name=name)
        # session.add(new_actor)
        return new_actor


def select_to_dataframe(query):
    with engine.connect() as connection:
        result = connection.execute(query)
    return pd.DataFrame(result)

/tmp/ipykernel_14734/2295612566.py:8: MovedIn20Warning: The ``declarative_base()`` function is now available as sqlalchemy.orm.declarative_base(). (deprecated since: 2.0) (Background on SQLAlchemy 2.0 at: https://sqlalche.me/e/b8d9)
  Base = declarative_base()

ObjectNotExecutableError: Not an executable object: '\n    DROP TABLE IF EXISTS \n    movie_actor_association, movies, actors;\n    '

## Batch Add movies and actors

In [4]:
for idx, row in df_movie[:3].iterrows():
    movie = Movie(title=row['originalTitle'], release_year=row['year'])
    actors  = [add_new_actor(name=actor) for actor in row['actors']]
    movie.actors = actors
    session.add(movie)
    
session.commit()

In [16]:
select_to_dataframe("SELECT * FROM movies;")

   id                     title  release_year
0   1  The Shawshank Redemption          1994
1   2             The Godfather          1972
2   3    The Godfather: Part II          1974
3   4                      坚如磐石          2023

In [17]:
select_to_dataframe("SELECT * FROM actors;")

    id            name
0    1     Tim Robbins
1    2  Morgan Freeman
2    3      Bob Gunton
3    4   Marlon Brando
4    5       Al Pacino
5    6      James Caan
6    7  Robert De Niro
7    8   Robert Duvall
8    9             于和伟
9   10             雷佳音
10  11             张国立
11  12              张译

In [18]:
select_to_dataframe("SELECT * FROM movie_actor_association;")

    movie_id  actor_id
0          1         2
1          1         1
2          1         3
3          2         5
4          2         4
5          2         6
6          3         8
7          3         7
8          3         5
9          4        10
10         4         9

## CRUD
### Create

In [8]:
def create_movie(title, release_year, actors, commit=True):
    movie = Movie(title=title, release_year=release_year)
    movie.actors  = [add_new_actor(name=actor) for actor in actors]
    session.add(movie)
    if commit:
        session.commit()

create_movie('坚如磐石', 2023, ['于和伟', '雷佳音'])

### Read (Retrieval data)

In [9]:
# Query all movies and their actors
for movie in session.query(Movie).all():
    print(movie.id, movie.title, movie.release_year, [actor.name for actor in movie.actors])

1 The Shawshank Redemption 1994 ['Morgan Freeman', 'Tim Robbins', 'Bob Gunton']
2 The Godfather 1972 ['Al Pacino', 'Marlon Brando', 'James Caan']
3 The Godfather: Part II 1974 ['Robert Duvall', 'Robert De Niro', 'Al Pacino']
4 坚如磐石 2023 ['雷佳音', '于和伟']

In [11]:
def get_movie(id):
    return session.query(Movie).filter_by(id=id).first()
    
get_movie(4).title

'坚如磐石'

### Update

In [12]:
def update_movie(id, title, release_year, actors, commit=True):
    movie = get_movie(id)
    if movie:
        movie.title=title
        movie.release_year=release_year
        movie.actors = [add_new_actor(name=actor) for actor in actors]
        if commit:
            session.commit()
            
create_movie('坚如磐石', 2023, ['张国立', '于和伟', '雷佳音'])   
update_movie(5, '悬崖之上', 2022, ['于和伟', '张译', '雷佳音'])

for movie in session.query(Movie).all():
    print(movie.id, movie.title, movie.release_year, [actor.name for actor in movie.actors])

1 The Shawshank Redemption 1994 ['Morgan Freeman', 'Tim Robbins', 'Bob Gunton']
2 The Godfather 1972 ['Al Pacino', 'Marlon Brando', 'James Caan']
3 The Godfather: Part II 1974 ['Robert Duvall', 'Robert De Niro', 'Al Pacino']
4 坚如磐石 2023 ['雷佳音', '于和伟']
5 悬崖之上 2022 ['于和伟', '雷佳音', '张译']

### Delete

In [15]:
def delete_movie(id):
    movie_to_delete = get_movie(id)
    if movie_to_delete:
        session.delete(movie_to_delete)
        session.commit()
    
delete_movie(5)